podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/LLWU_MK82F25615.svd.xml
<!--
Devices using this peripheral: 
      MK82F25615
-->
      <peripheral>
         <?sourceFile "LLWU_MK82F25615" ?>
         <name>LLWU</name>
         <description>Low leakage wakeup unit</description>
         <groupName>LLWU</groupName>
         <prependToName>LLWU_</prependToName>
         <headerStructName>LLWU</headerStructName>
         <baseAddress>0x4007C000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <?width "8" ?>
            <offset>0x0</offset>
            <size>0x12</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>PE1</name>
               <description>LLWU Pin Enable 1 register</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WUPE0</name>
                     <description>Wakeup Pin Enable For LLWU_P0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>External input pin disabled as wakeup input</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>External input pin enabled with rising edge detection</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>External input pin enabled with falling edge detection</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>External input pin enabled with any change detection</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="WUPE0" > <name>WUPE1</name> <description>Wakeup Pin Enable For LLWU_P1</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="WUPE0" > <name>WUPE2</name> <description>Wakeup Pin Enable For LLWU_P2</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WUPE0" > <name>WUPE3</name> <description>Wakeup Pin Enable For LLWU_P3</description> <bitOffset>6</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PE2</name>
               <description>LLWU Pin Enable 2 register</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WUPE4</name>
                     <description>Wakeup Pin Enable For LLWU_P4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>External input pin disabled as wakeup input</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>External input pin enabled with rising edge detection</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>External input pin enabled with falling edge detection</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>External input pin enabled with any change detection</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="WUPE4" > <name>WUPE5</name> <description>Wakeup Pin Enable For LLWU_P5</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="WUPE4" > <name>WUPE6</name> <description>Wakeup Pin Enable For LLWU_P6</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WUPE4" > <name>WUPE7</name> <description>Wakeup Pin Enable For LLWU_P7</description> <bitOffset>6</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PE3</name>
               <description>LLWU Pin Enable 3 register</description>
               <addressOffset>0x2</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WUPE8</name>
                     <description>Wakeup Pin Enable For LLWU_P8</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>External input pin disabled as wakeup input</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>External input pin enabled with rising edge detection</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>External input pin enabled with falling edge detection</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>External input pin enabled with any change detection</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="WUPE8" > <name>WUPE9</name> <description>Wakeup Pin Enable For LLWU_P9</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="WUPE8" > <name>WUPE10</name> <description>Wakeup Pin Enable For LLWU_P10</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WUPE8" > <name>WUPE11</name> <description>Wakeup Pin Enable For LLWU_P11</description> <bitOffset>6</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PE4</name>
               <description>LLWU Pin Enable 4 register</description>
               <addressOffset>0x3</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WUPE12</name>
                     <description>Wakeup Pin Enable For LLWU_P12</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>External input pin disabled as wakeup input</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>External input pin enabled with rising edge detection</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>External input pin enabled with falling edge detection</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>External input pin enabled with any change detection</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="WUPE12" > <name>WUPE13</name> <description>Wakeup Pin Enable For LLWU_P13</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="WUPE12" > <name>WUPE14</name> <description>Wakeup Pin Enable For LLWU_P14</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WUPE12" > <name>WUPE15</name> <description>Wakeup Pin Enable For LLWU_P15</description> <bitOffset>6</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PE5</name>
               <description>LLWU Pin Enable 5 register</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WUPE16</name>
                     <description>Wakeup Pin Enable For LLWU_P16</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>External input pin disabled as wakeup input</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>External input pin enabled with rising edge detection</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>External input pin enabled with falling edge detection</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>External input pin enabled with any change detection</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="WUPE16" > <name>WUPE17</name> <description>Wakeup Pin Enable For LLWU_P17</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="WUPE16" > <name>WUPE18</name> <description>Wakeup Pin Enable For LLWU_P18</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WUPE16" > <name>WUPE19</name> <description>Wakeup Pin Enable For LLWU_P19</description> <bitOffset>6</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PE6</name>
               <description>LLWU Pin Enable 6 register</description>
               <addressOffset>0x5</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WUPE20</name>
                     <description>Wakeup Pin Enable For LLWU_P20</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>External input pin disabled as wakeup input</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>External input pin enabled with rising edge detection</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>External input pin enabled with falling edge detection</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>External input pin enabled with any change detection</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="WUPE20" > <name>WUPE21</name> <description>Wakeup Pin Enable For LLWU_P21</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="WUPE20" > <name>WUPE22</name> <description>Wakeup Pin Enable For LLWU_P22</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WUPE20" > <name>WUPE23</name> <description>Wakeup Pin Enable For LLWU_P23</description> <bitOffset>6</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PE7</name>
               <description>LLWU Pin Enable 7 register</description>
               <addressOffset>0x6</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WUPE24</name>
                     <description>Wakeup Pin Enable For LLWU_P24</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>External input pin disabled as wakeup input</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>External input pin enabled with rising edge detection</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>External input pin enabled with falling edge detection</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>External input pin enabled with any change detection</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="WUPE24" > <name>WUPE25</name> <description>Wakeup Pin Enable For LLWU_P25</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="WUPE24" > <name>WUPE26</name> <description>Wakeup Pin Enable For LLWU_P26</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WUPE24" > <name>WUPE27</name> <description>Wakeup Pin Enable For LLWU_P27</description> <bitOffset>6</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PE8</name>
               <description>LLWU Pin Enable 8 register</description>
               <addressOffset>0x7</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WUPE28</name>
                     <description>Wakeup Pin Enable For LLWU_P28</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>External input pin disabled as wakeup input</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>External input pin enabled with rising edge detection</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>External input pin enabled with falling edge detection</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>External input pin enabled with any change detection</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="WUPE28" > <name>WUPE29</name> <description>Wakeup Pin Enable For LLWU_P29</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="WUPE28" > <name>WUPE30</name> <description>Wakeup Pin Enable For LLWU_P30</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WUPE28" > <name>WUPE31</name> <description>Wakeup Pin Enable For LLWU_P31</description> <bitOffset>6</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>ME</name>
               <description>LLWU Module Enable register</description>
               <addressOffset>0x8</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WUME0</name>
                     <description>Wakeup Module Enable For Module 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Internal module flag not used as wakeup source</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Internal module flag used as wakeup source</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="WUME0" > <name>WUME1</name> <description>Wakeup Module Enable for Module 1</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="WUME0" > <name>WUME2</name> <description>Wakeup Module Enable For Module 2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="WUME0" > <name>WUME3</name> <description>Wakeup Module Enable For Module 3</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="WUME0" > <name>WUME4</name> <description>Wakeup Module Enable For Module 4</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WUME0" > <name>WUME5</name> <description>Wakeup Module Enable For Module 5</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="WUME0" > <name>WUME6</name> <description>Wakeup Module Enable For Module 6</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="WUME0" > <name>WUME7</name> <description>Wakeup Module Enable For Module 7</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
